Revit 2027 API
BuiltInFailures.GroupFailures.RemoveGroupSketchConstraintParent Property
 You are removing an element from the group which is involved in a sketch or family constraint with another element of the same group. Either remove the constraint or cancel the removal of this element from the group.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RemoveGroupSketchConstraintParent { get; }
Public Shared ReadOnly Property RemoveGroupSketchConstraintParent As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RemoveGroupSketchConstraintParent {
	FailureDefinitionId^ get ();
}
static member RemoveGroupSketchConstraintParent : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GroupFailures Class
Autodesk.Revit.DB Namespace